In [49]:
conda install -c conda-forge word2number

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [50]:

import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n
import matplotlib.pyplot as plt

In [51]:
df= pd.read_csv('hiring.csv')

In [52]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [53]:
df.experience=df.experience.fillna('zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [54]:
df.experience = df.experience.astype(str)
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [55]:
df.rename(columns={'test_score(out of 10)':'testscore'}, inplace=True)
df.rename(columns={'salary($)':'salary'}, inplace=True)
df

   experience  testscore  interview_score(out of 10)  salary
0           0        8.0                           9   50000
1           0        8.0                           6   45000
2           5        6.0                           7   60000
3           2       10.0                          10   65000
4           7        9.0                           6   70000
5           3        7.0                          10   62000
6          10        NaN                           7   72000
7          11        7.0                           8   80000

In [56]:
df.testscore=df.testscore.median()
df

   experience  testscore  interview_score(out of 10)  salary
0           0        8.0                           9   50000
1           0        8.0                           6   45000
2           5        8.0                           7   60000
3           2        8.0                          10   65000
4           7        8.0                           6   70000
5           3        8.0                          10   62000
6          10        8.0                           7   72000
7          11        8.0                           8   80000

In [57]:
new_df=df.drop('salary',axis='columns')
new_df

   experience  testscore  interview_score(out of 10)
0           0        8.0                           9
1           0        8.0                           6
2           5        8.0                           7
3           2        8.0                          10
4           7        8.0                           6
5           3        8.0                          10
6          10        8.0                           7
7          11        8.0                           8

In [58]:
Salary=df['salary']
Salary

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [59]:
reg = linear_model.LinearRegression()
reg.fit(new_df,Salary)

LinearRegression()

In [60]:
reg.coef_

array([2704.9012934,    0.       , 2307.0115725])

In [61]:
reg.intercept_

31984.002722940786

In [62]:
reg.predict([[2,9,6]])

array([51235.87474472])